parametric_campaign/cases/DOE_Case_001/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         350;
deltaT          1;
writeControl    timeStep;
writeInterval   350;
purgeWrite      2;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    pressureDrop
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   25;
        log             true;
        writeFields     false;
        surfaceFormat   none;
        regionType      patch;
        name            inlet;
        operation       areaAverage;
        fields          (p);
    }
}
