parametric_campaign/cases/DOE_Case_001/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale 1.0;

vertices
(
    // Layer 0: z = 0.000 (Chassis bottom / Chip base)
    (0.000 -0.0700 0.000) // 0
    (0.000  0.0700 0.000) // 1
    (0.100 -0.0700 0.000) // 2
    (0.100  0.0700 0.000) // 3
    (0.180 -0.0700 0.000) // 4
    (0.180  0.0700 0.000) // 5
    (0.240 -0.0700 0.000) // 6
    (0.240  0.0700 0.000) // 7
    (0.320 -0.0700 0.000) // 8
    (0.320  0.0700 0.000) // 9
    (0.400 -0.0700 0.000) // 10
    (0.400  0.0700 0.000) // 11

    // Layer 1: z = 0.04445 (Top chassis shroud wall)
    (0.000 -0.0700 0.04445) // 12
    (0.000  0.0700 0.04445) // 13
    (0.100 -0.0700 0.04445) // 14
    (0.100  0.0700 0.04445) // 15
    (0.180 -0.0700 0.04445) // 16
    (0.180  0.0700 0.04445) // 17
    (0.240 -0.0700 0.04445) // 18
    (0.240  0.0700 0.04445) // 19
    (0.320 -0.0700 0.04445) // 20
    (0.320  0.0700 0.04445) // 21
    (0.400 -0.0700 0.04445) // 22
    (0.400  0.0700 0.04445) // 23
);

blocks
(
    hex (0 2 3 1 12 14 15 13)       (20 32 18) simpleGrading (1 1 1)
    hex (2 4 5 3 14 16 17 15)       (24 32 18) simpleGrading (1 1 1)
    hex (4 6 7 5 16 18 19 17)       (16   32 18) simpleGrading (1 1 1)
    hex (6 8 9 7 18 20 21 19)       (24 32 18) simpleGrading (1 1 1)
    hex (8 10 11 9 20 22 23 21)     (20  32 18) simpleGrading (1 1 1)
);

edges ();

defaultPatch
{
    name walls;
    type wall;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 13 12)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (10 22 23 11)
        );
    }
    chip_bases
    {
        type wall;
        faces
        (
            (2 4 5 3)
            (6 8 9 7)
        );
    }
);
