parametric_campaign/cases/DOE_Case_001/0/T
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
dimensions      [0 0 0 1 0 0 0];
internalField   uniform 298.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 298.15;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    heat_sink_surfaces
    {
        type            zeroGradient;
    }
    chip_bases
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform 62500.00;
        value           uniform 298.15;
        kappaMethod     fluidThermo;
    }
}
