parametric_campaign/cases/DOE_Case_001/0/k
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1e-05;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-05;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            kLowReWallFunction;
        value           uniform 1e-05;
    }
    heat_sink_surfaces
    {
        type            kLowReWallFunction;
        value           uniform 1e-05;
    }
    chip_bases
    {
        type            kLowReWallFunction;
        value           uniform 1e-05;
    }
}
